Tekla Open API Reference for Tekla Structures 2025
ModelObjectSelector Class
 The ModelObjectSelector class can be used to make different model object selections from the current model.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.ModelObjectSelector
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ModelObjectSelector
<SerializableAttribute>
Public NotInheritable Class ModelObjectSelector
The ModelObjectSelector type exposes the following members.
Methods
Name | Description
GetAllObjects
 Returns an enumerator of all the model objects in the current model.
GetAllObjectsWithType(Type[])
 Returns an enumerator of all the model objects in the current model with the given base type.
GetAllObjectsWithType(ModelObject.ModelObjectEnum)
 Returns an enumerator of all the model objects in the current model with the given type.
GetEnumerator
 Returns an enumerator of all the model objects in the current model.
GetFilteredObjectsWithType
 Returns an enumerator of the model objects in the current model with the given type and selected by the filter.
GetObjectsByBoundingBox
 Returns an enumerator of the model objects in the current model colliding with the given geometrical bounding box. Note that this method uses approximate bounding boxes and thus is NOT EXACT, and may return objects not necessarily colliding with the given box but only being somewhere near to it.
GetObjectsByFilter
 Returns an enumerator of the model objects in the current model selected by the given selection filter definition.
GetObjectsByFilterName
 Returns an enumerator of the model objects in the current model selected by the given selection filter.
Top
Examples
using Tekla.Structures.Model;
public class Example
{
       public void Example1()
       {
           Model Model = new Model();
           ModelObjectSelector Selector = Model.GetModelObjectSelector();
           ModelObjectEnumerator listObjects = Selector.GetAllObjects();
           foreach(ModelObject MO in listObjects)
           {
               Beam B = MO as Beam;
               if(B != null)
               {
                   Solid solid = B.GetSolid();
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Model Namespace